---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisSkylightWidth
source: html/17c1ffbf-de3a-fc2f-ac8d-8fd489241120.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisSkylightWidth Property

"Skylight Width & Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisSkylightWidth { get; }
```